{"title":"学生社团发展管理中心","shareable":true,"content":[{"tag":"intro","name":"学生社团发展管理中心","logo":"https://mp.innenu.com/img/organization/sheguan.png","desc":"东北师范大学学生社团发展管理中心"},{"tag":"p","heading":" ","text":["东北师范大学学生社团发展管理中心是校团委直属机构，在校团委社团指导部具体指导下协助开展对全校学生社团的指导与管理工作。东北师范大学学生社团发展管理中心成立于 2019 年，前身是成立于 1999 年的学生社团联合会。","东北师范大学学生社团发展管理中心以“优化社团管理，凝聚社团精英，打造卓越团队”为工作理念，实行主席团负责制。多年来，校学生社团发展管理中心先后成功举办了社团文化节系列活动、“佣兵天下”、“四海承风”社团能力培训营、“红色理论社团”专项培育计划、雪碧“我型我秀”和“我是大逗王”等多项选秀活动、东师社团趣味运动会、“锦绣'家'年华”新年联欢会、“真情面对面”社联与协会交流座谈会、社团建骨干素质拓展计划等一系列大型活动，为社团间的交流互动、社团骨干的能力提升和社团活动影响力的扩大搭建了广阔的平台，发挥了重要的作用。","在学生社团发展管理中心的积极倡导、大力支持和正确引领下，一批体系完善、规模庞大、活动丰富的知名社团不断涌现出来，进一步带动了全校各类学生社团的蓬勃发展。三农学社，秉承“让农民自己说话，让事实说话，让生活说话”的宗旨，坚持学术研究、积极实践，被评为“全国优秀社团”、“吉林省十佳社团”。","2016 年，创行协会获创行世界杯中国站-区域赛“社会创新大赛三等奖”“最多元文化奖”；常春藤协会获国际学生环境与可持续发展“大绿色未来奖”，被评为第五届中国公益慈善项目大赛大学生公益创项目百强项目团队、世界地球日“亿绿行动”优秀组织团队；集英动漫社获中国二次元风云榜“全国十佳社团称号”；绿色动力环保志愿者协会，科尔沁环保考察系列活动受到社会各界的广泛关注，曾荣获“全国优秀社团”荣誉称号……","“用无限的激情打造无悔的青春”，相信东师学生社团发展管理中心与社团的明天会更加辉煌灿烂!"],"style":"text-indent: 1.5em; "},{"tag":"title","text":"部门介绍"},{"tag":"text","heading":"办公室","text":["负责上情下达，保障信息通畅，加强学生社团发展管理中心成员内部联系，协调各部门事务；负责会议记录、财务报销、制定日常工作安排及规章制度等工作。"]},{"tag":"text","heading":"宣传部","text":["负责运营“东师社团”微信公众号及其他新媒体平台，以及社管中心举办的各大活动的线下宣传工作。海报制作、微信推送、抖音拍摄……都是我们宣传的方式。"]},{"tag":"text","heading":"注册部","text":["负责策划、组织、开展一年一度的百团大战、学生社团骨干培训班等活动，激发学生社团活力与创造力，是负责完善社管中心各项规章制度、保持各学生社团与社管中心维持健康良好关系的桥梁。"]},{"tag":"text","heading":"活动部","text":["负责策划、组织、开展社团文化节、社团骨干培训班等活动，提升社团活力。选拔和培养社团发展管理中心内部成员，提高社团及中心成员的工作能力。"]},{"tag":"text","heading":"调研部","text":["负责举办学生社团发展管理中心成员内部例会等活动，提高内部成员的理论素养，提升内部成员的凝聚力和向心力；总结学生社团发展状况，调研并汇总理论研究成果，指导学生社团的思想政治工作。"]},{"tag":"text","heading":"考评部","text":["负责记录、管理和监督各学生社团活动，组织学生社团评比，促进学生社团健康有序发展，是一年一度的学生社团分级评定大会的主力军。"]}],"images":[],"id":"guide/organization/association-union","scopeData":{"@type":"general","uniq_id":"guide/organization/association-union","title":"学生社团发展管理中心","digest":"  东北师范大学学生社团发展管理中心是校团委直属机构，在校团委社团指导部具体指导下协助开展对全校学生社团的指导与管理工作。东北师范大学学生社团发展管理中心成立于 2019 年，前身是成立于 1999 年的学生社团联合会。 东北师范大学学生社","thumbs":["https://mp.innenu.com/img/inNENU.jpg"],"tags":["部门介绍"]}}