{"title":"小程序使用介绍","author":"Mr.Hope","shareable":true,"content":[{"tag":"title","text":"小程序介绍"},{"tag":"text","heading":"板块介绍","text":["in 东师小程序包含了“东师介绍”、“东师指南”与“功能大厅”三个板块。"]},{"tag":"text","heading":"东师介绍","text":["“东师介绍”通过十六万余字、上百张图片和数十份相关文件全方位的介绍了学校的相关信息、校规校纪、常用文件等。","同时，东师介绍板块还包含了所有学院的学院介绍与开设专业介绍。几乎所有本科专业都有对应的详细介绍。","该板块还包含了东师常用的机构介绍、他们对应服务的办理说明以及相关文件与规章制度。"]},{"tag":"text","heading":"东师指南","text":["“东师指南”通过十五万余字、数百张图片和数十份相关文件，从 33 个不同板块全面介绍东师的各类信息。","新生同学对学校的任何疑问几乎都可以在该板块找到答案。"]},{"tag":"text","heading":"功能大厅","text":["“功能大厅”包含了一些腾讯允许个人开发者做的功能板块，文字数量超三万字。"]},{"tag":"text","type":"warning","text":["其他某些功能并不是 Mr.Hope 不做，而是制作后无法通过腾讯审核。"]},{"tag":"ul","text":["“校园地图” 仅微信小程序可用，包含了东师的全部地点标记，方便新生入学初期不熟识校园时在校园内进行导航。同时，该板块还包含了对应地点 2 万余字的介绍。","“音悦东师” 包含了多个东师原创歌曲。","“影约东师” 包含了东师的风采介绍、专业介绍等。","“校历” 包含了近年来东师的具体活动日程安排。","“天气” 包含了两校区详细的天气介绍。","“体测计算器” 是针对东师自己特有的体测评分标准进行编写的体测计算器(目前暂不含指定项目满分后的加分逻辑)。","“校园公众号” 包含了东师知名校园微信公众号及其对应图文(目前还在补充中...)。"]},{"tag":"title","text":"小程序搜索"},{"tag":"p","text":["小程序涵盖了新生绝大部分问题，但考虑到小程序字数超过 40 万字，您可能很难快速找到您需要的内容，因此 Mr.Hope 开发了搜索功能并添加进了小程序中。当您不知道您想要了解的内容在哪个板块时，不妨试试搜索。"],"style":"text-indent: 1.5em; "},{"tag":"ul","type":"info","heading":"搜索介绍","text":["小程序内含搜索功能，支持对“东师介绍”和“东师指南”部分进行全文搜索。","由于小程序搜索依赖于 Mr.Hope 出资的每天不足两元、配置很差的服务器，因此小程序的搜索算法较为简单。请您在搜索时，仔细选择您需要了解内容的核心关键词并对其进行搜索。"]},{"tag":"ul","type":"tip","heading":"搜索技巧","text":["您需要精简搜索的关键词，相关程度不高的字词会导致匹配到一些不相关结果。","另外，匹配字数相同时，小程序默认在前的词组优先级更高，所以请将您搜索的核心关键词放在最前。","比如您想搜索物理学院的新生群，在直接输入“物理学院新生群”是，小程序会先检索 “物理学院新生群” 的完全匹配。但小程序无法找到。之后小程序会将其拆分成“物理学院”与“新生群”。由于“物理学院”为四字词语且排在前面，并且在小程序中产生大量匹配，因此搜索结果大部分都是“物理学院”、“物理”、“学院”相关的内容，新生群的匹配结果可能会排在列表的中后部。此时，应单纯搜索“新生群”，能够保证全部命中“新生群\"相关页面方便找到所需内容。"]},{"tag":"title","text":"咨询须知"},{"tag":"text","text":["Mr.Hope 欢迎大家前来对自己的疑问进行咨询。东师指南板块可能会缺少个别偏门的内容，如果您无法找到相关说明，欢迎向我咨询，我会耐心解答并过后补充在小程序中。"]},{"tag":"ul","type":"warning","heading":"您应当保证","text":["您在提问前搜索小程序，确定无法通过搜索功能搜索到问题答案。","您的问题并非针对特定专业。\n除自己就读以及所在学院开设的专业外，Mr.Hope 不了解其他专业的课程难易程度、老师选择、就业去向等问题。Mr.Hope 已经联系了很多学院的优秀毕业生提供对应学院的相关介绍以及建议，能提供给您的已经全在小程序里了。","您的问题并非让 Mr.Hope 解读相关学校政策、文件。\n学校政策、文件解释权均在学校办公室或对应机构手中，Mr.Hope 对对应政策的解读是完全无效的。常见的疑问可以见文件附近的“常见问题页面”(如果有)\n如果您对学校政策、文件原文有额外其他任何疑问，请致电拥有对应解释权的相关机构咨询。","您的问题并非让 Mr.Hope 评价学院、学校、专业的相关方面。\n作为一名在读研究生，Mr.Hope 不想对母校做出任何负面评价，只包含正面评价的回答对您无参考价值，所以请您不要询问相关问题。"]},{"tag":"title","text":"小程序性质"},{"tag":"ul","text":["小程序是由 Mr.Hope，一名东师在读研究生个人独自开发的小程序，目前小程序的所有代码、内容均由 Mr.Hope 一个人进行编写、扩充与维护的。","小程序现有文字数量超过 40 万字(不包含附带文件以及英文字符、标点符号)；页面数量超过 800 页。Mr.Hope 在小程序上花费的时间是需要以“千小时”单位进行计量的。","由于小程序全由 Mr.Hope 个人开发，学校也没有提供任何形式的支持与援助，所以小程序并非东师官方小程序。同样，由于内容未经官方审查，小程序自然不会出现在任何官方平台及其宣传上。","小程序是一个完完全全由 Mr.Hope 一人发起并坚决执行数年的公益项目，自 2018 年以来，小程序已联系服务三余载，累计服务六万余人，Mr.Hope 会继续做下去，做的更久、做的更好。","学校从未对小程序提供过任何形式 (包括资料和经费) 的帮助，Mr.Hope 已在小程序服务器等费用上个人支出数千元，同样付出了近两千个小时，如果您看到这里并在过后对小程序的使用后觉得小程序很赞，欢迎打赏 Mr.Hope。1 - 5 元就够了。"]},{"tag":"img","src":"https://mp.innenu.com/img/about/warning.png","desc":"由于腾讯不允许个人小程序直接放置收款二维码，如果您想要捐赠，请联系 Mr.Hope"},{"tag":"advanced-list","header":false,"content":[{"text":"微信联系 Mr.Hope","icon":"contact","type":"button","openType":"contact"},{"text":"QQ联系 Mr.Hope","icon":"contact","type":"button","openType":"addFriend","openId":"868D7B2F0C609B4285698EAB77A47BA1"}]},{"tag":"title","text":"其他须知"},{"tag":"ol","type":"danger","text":["该小程序为 Mr.Hope 个人的小程序，与学校无关，学校不对该小程序内容的正确与否负责。","Mr.Hope 在此郑重声明，Mr.Hope 会竭力保持小程序内容的正确性，但 40 万余字的内容难免会存在部分疏漏。Mr.Hope 不对小程序可能存在的部分错误内容负责。","小程序的东师指南部分含有大量(约 9 万字) Mr.Hope 的吐槽与建议。\n这些吐槽和建议在 Mr.Hope 看来是极其有用的。它们通常包含了学校一些实际情况的准确描述说明，部分问题、活动的实际本质与良好的执行方式，或者 Mr.Hope 根据自己和身边优秀毕业生经验的带有主观性色彩的避坑指南与贴心提示建议。\n但是学校官方会不可避免的认为，其中的部分内容涉及到学校的负面性评价与描述，或者过于深刻的揭穿了某些问题的本质，而且这些内容含有 Mr.Hope 的主观色彩，不具有客观性，所以学校官方不会公开宣传或正面评价本小程序，甚至不排除在将来因为某些内容抵制本小程序的情况。\nMr.Hope 自然不会移除自己用心写的观点看法，学校官方也自然永远不会公开宣传或正面评价本小程序。本小程序究竟如何您可以自己体验感受，或询问学长学姐他们的观点看法。","本小程序内的所有开发者联系方式和小程序内的客服、反馈渠道的回应人均为 Mr.Hope，请勿当作是学校老师或是相关客服。\n如果您出现辱骂、鄙视、指使等行为，Mr.Hope 有权也将会将您屏蔽、删除、拉黑。\n同样，如果您多次询问小程序已有内容，并拒绝听从 Mr.Hope 查看小程序的劝导持续提问并“期望” Mr.Hope 回答，不论您是否足够有礼貌，Mr.Hope 同样会将拒绝回应您，甚至屏蔽、删除、拉黑。"]}],"images":["https://mp.innenu.com/img/about/warning.png"],"id":"other/about/guide","scopeData":{"@type":"general","uniq_id":"other/about/guide","cover":"https://mp.innenu.com/img/about/warning.png","title":"小程序使用介绍","digest":"板块介绍 in 东师小程序包含了“东师介绍”、“东师指南”与“功能大厅”三个板块。东师介绍 “东师介绍”通过十六万余字、上百张图片和数十份相关文件全方位的介绍了学校的相关信息、校规校纪、常用文件等。 同时，东师介绍板块还包含了所有学院的学院","thumbs":["https://mp.innenu.com/img/about/warning.png"],"tags":["小程序介绍","小程序搜索","咨询须知","小程序性质","其他须知"]}}