{"title":"东北师范大学介绍","desc":"摘自 2022 年本科招生指南","time":"2022年6月26日","cite":["https://book.eol.cn/books/cusm/mobile/index.html"],"shareable":true,"content":[{"tag":"title","text":"学校简介"},{"tag":"p","text":["巍巍东师，根溯延安。1945 年 10 月 25 日，毛泽东主席接见延安大学校院主要领导干部，指示学校向东北迁移，创办“新型的东北大学”。1946 年 2 月东北大学在本溪建校，是中国共产党在东北地区创建的第一所综合性大学。1949 年 7 月定址于长春。1950 年 4 月更名为东北师范大学。1996 年 9 月成为首批国家“211 工程”重点建设大学。2004 年 6 月经教育部批准设立研究生院。2007 年，入选国家教师教育“985 工程”优势学科创新平台建设高校。2017 年 9 月，入选国家“双一流”建设高校。","两区办学，专业合理。学校现有自由校区和净月校区。全日制在校学生 26000 余人，专任教师 1716 人，其中教授 530 人，副教授 645 人。学校设有 21 个学院（部），82 个本科专业，23 个博士学位授权一级学科，37 个硕士学位授权一级学科，1 个博士专业学位授权点和 21 个硕士专业学位授权点，以及 22 个博士后科研流动站。学科点覆盖了除军事学和医学以外的 11 个学科门类，形成了层次分明、类型多样的人才培养体系。","特色鲜明，成效斐然。学校以教育教学为立校之本。建校 70 余年来，形成了“为基础教育服务”的鲜明办学特色，被誉为“人民教师的摇篮”。上世纪50年代，我国著名教育家、校长成仿吾提出了为中小学教育服务的办学思想，学校首开中国高师函授教育之先河；80 年代，学校主动服务农村基础教育，走出了一条享誉基础教育界的“长白山之路”；90 年代，实施“优师工程”，为基础教育培养优秀教师；进入新世纪，启动实施“教育家培养工程”，探索“U-G-S 教师教育新模式”。“优师工程”和“U-G-S 教师教育新模式”先后荣获高等教育国家级教学成果一等奖。","科研强校，成果丰硕。学校以科学研究为强校之本。近年来，学校学科建设工作取得历史性突破，在国家“双一流”建设中,我校马克思主义理论、教育学、世界史、化学、统计学、材料科学与工程 6 个学科入选国家“双一流”建设学科，入选学科数量并列全国高校第 19 位。在教育部学位中心第四轮学科评估中，A 类学科 6 个（其中马克思主义理论获评 A+)，B 类学科 15 个。34 个学科入选吉林省特色高水平学科。46 个专业入选国家级一流本科专业建设点，占全校本科招生专业〈不含无毕业生专业）总数的 85%，所有本科招生专业均已获批省级以上一流本科专业建设点。历史学、陆家羲数学物理、生物科学 3 个基地获批教育部基础学科拔尖学生培养计划 2.0 基地。学校现有药物基因和蛋白筛选 1 个国家工程实验室和 14 个部级重点研究基地，世界文明史研究中心、农村教育研究所 2 个教育部人文社会科学重点研究基地。近年来，获得国家自然科学二等奖四项，其中材料科学研究领域的两项、统计学研究领域的一项、化学研究领域的一项成果获此殊荣;获得第七、八届高等学校科学研究优秀成果奖（人文社会科学）一等奖四项，其中历史学研究领域的三项、马克思主义理论研究领域的一项成果获此殊荣。","开放办学，助力发展。学校先后与美国、加拿大、英国、澳大利亚、韩国、日本、俄罗斯等 30 多个国家和地区的 300 余所大学和科研机构建立了合作交流关系。2015 年，与美国罗格斯新泽西州立大学合作设立了东北师范大学罗格斯纽瓦克学院。学校在韩国、西班牙、加拿大、蒙古建立了孔子学院。国家汉办、国务院侨办、教育部及外交部分别在我校设立了“国际汉语教师培训基地”“华文教育基地”“教育援外基地”“中国-东盟教育培训中心”。中国赴日本国留学生预备学校设在我校。","群星璀璨,人才辈出。学校拥有一批国内外著名的专家学者。诗人、《中国人民解放军军歌》词作者公木张松如），作家萧军、吴伯箫，文学史家杨公骥，语言学家孙常叙，历史学家李询、丁则民、林志纯，教育学家陈元晖，音乐家马可、吕骥，病理学家白希清，数学家张德馨，核物理学家王琳，地理学家丁锡祉，鸟类学家傅桐生，中科院院士生物学家郝水，新中国学校体育创始人之一杨钟秀，大型团体操编导艺术家杨瑞雪、“红色理论家”郑德荣等著名学者，都曾经工作生活在这里。建校 70 余年来，学校传承红色基因，弘扬“强师报国，求实创造”的东师精神，共为国家培养输送各级各类毕业生 30 余万人，一大批优秀人才在教育领域脱颖而出，如攻克世界著名数学难题获得国家自然科学一等奖的包头九中教师陆家羲、感动中国的支边教师冯志远、全国模范教师郭力华、全国特级教师窦桂梅、全国十杰教师马宪华、全国教书育人楷模高夯等。同时也培养了著名生态学家郑光美院士，物理学家孙昌璞院士、刘益春院士，地理学家刘兴土院士，著名作家张笑天等为代表的各类人才。东师人“信念坚实、学识扎实、为人朴实、作风踏实”的“四实品格”得到社会广泛认可。","承典塑新，力行致远。新时代，新使命，新征程。东北师大将以学校第十五次党代会的胜利召开为契机，践行“尊重的教育、创造的教育”理念，坚持立德树人，深化内涵发展，提升教育质量，努力推进世界一流师范大学建设进程。"],"style":"text-indent: 1.5em; "},{"tag":"ul","type":"tip","heading":"联系方式","text":["地址: 吉林省长春市人民大街5268号(130024)","电话: 0431-85684088","传真: 0431-85684009"]},{"tag":"phone","fName":"东北师范大学","num":"0431-85684088","org":"东北师范大学","street":"吉林省长春市人民大街5268号","postCode":"130024","site":"https://www.nenu.edu.cn/"}],"id":"intro/about/intro"}