{"title":"物理学介绍","author":"Mr.Hope","desc":"来源: 2021年本科招生指南\n优秀毕业生经验来自张歌扬","time":"2021年8月15日","shareable":true,"content":[{"tag":"title","text":"专业简介"},{"tag":"p","text":["为教育部批准备案的师范专业，学生毕业后可选择从事教师职业，也可选择继续攻读研究生，或选择从事其他职业。旨在立足东北，面向国家物理学基础研究人才需求，培养专业基础宽厚扎实、综合素质高、适合在物理学及相关的科学技术领域中从事科学研究的专门人才和能够适应新时代教育事业改革发展要求的中学物理教师。"],"style":"text-indent: 1.5em; "},{"tag":"title","text":"主干课程"},{"tag":"ul","text":["高等数学","线性代数","力学","热学","光学","电磁学","原子物理","基础物理实验","综合物理实验","数学物理方法","理论力学","量子力学","电动力学","热力学与统计物理","固体物理","近代物理实验","电子线路与实验","探索物理实验"]},{"tag":"title","text":"就业方向"},{"tag":"text","text":["为高等教育院校及科研院所培养物理学专门人才，或从事与物理学相关的工作。"]},{"tag":"title","text":"优秀毕业生经验"},{"tag":"p","heading":"课程要求","text":["物理学开设的课程由浅入深，对同学们的要求有以下几点。"],"style":"text-indent: 1.5em; "},{"tag":"ol","text":["系统全面地掌握本专业所需的基础理论及实验的基本方法和技能；具有创新思维能力及解决问题的初步能力。","了解相关学科的前沿和发展动态，具有较强的自学能力和初步从事科学研究的能力，有利于进一步攻读相关专业的硕士、博士学位研究生。","掌握本专业必需的数学基础，具备较高的科技英语写作水平和沟通能力，以及运用计算机进行物理实验和模拟计算的能力。","具有正确的物质观和科学的世界观，具备集体合作和组织协调能力，身心健康。"]},{"tag":"p","text":["具体来说大一大二的课程是普通物理课程和基础物理实验，每位老师的讲解方法不同，选课时可以按着自己的理解方式选择不同的任课老师，理解有困难的同学可以在课后多问多练。","大三课程比较难，四大力学以及固体物理需要同学们下功夫思考和理解。由于不同老师上课时间是错开的，同学们可以听两遍。"],"style":"text-indent: 1.5em; "},{"tag":"p","heading":"课程学习经验","text":["学习普通物理的过程中，大家一定要课前把书上相关内容看一遍，不需要花大量时间理解记忆，这是为了课上能跟上老师思路，免得对内容完全陌生，课上时间不能充分利用。","上课过程中如果理解起来非常轻松，那么就课上完成笔记，如果发现自己听老师讲解都快跟不上了，可以先把重要的笔记拍下来，下课进行誊写。大学老师讲的内容不会特别细致，强调的是课程的逻辑性和连贯性，大家在理解好整体知识框架的同时，要多看书补充细节知识点。","只完成课后作业是不够的，课后习题最好都做一遍，期末考试前甚至要多做几遍，公式也要推导明白，我们学习不仅是为了考试，更重要的是补充知识储备和锻炼对公式的理解能力。很多老师在上第一节课的时候会推荐相关的教材，大家可以在图书馆找到或者网上购买，之后结合课程教材研读，会有更多的收获。","这里是一位大佬同学推荐的教材: 赵凯华《新概念物理》全套(对应大一、大二全部物理内容)，朗道《力学》及鞠国兴《朗道<力学>学习指导》(对应力学和理论力学)，格里菲斯《电磁学导论》(对应电磁学和电动力学)，格里菲斯《量子力学导论》(对应量子力学)。"],"style":"text-indent: 1.5em; "},{"tag":"p","heading":"大学的比赛","text":["中国大学生物理学术竞赛(CUPT)是借鉴国际青年物理学家竞赛(IYPT)的模式创办的国内全国性赛事，该项赛事得到了教育部的支持，是实践国家教育中长期发展规划纲要的重要大学生创新竞赛活动之一。","对于物理学的同学，这个比赛能很好的锻炼同学们的团队合作能力和科研思维能力，并且对于想要保送研究生的同学，这个也是一个很好的条件和机会。学院首先会组织院内比赛进行队员的选拔，之后表现优秀的同学会参加吉林省的比赛以及东北赛区的比赛，经过锻炼并且拿到国家级比赛资格后，就可以与全国优秀的大学生进行比赛交流了。"],"style":"text-indent: 1.5em; "},{"tag":"p","heading":"交流学习机会","text":["成绩优异者有机会前往台湾作为交换生学习。"],"style":"text-indent: 1.5em; "},{"tag":"p","heading":"教师介绍","text":["教师队伍实力雄厚，有年轻的老师任教，讲课充满激情，思路新颖；也有年长的老师任教，知识储备量充足，讲课细致清晰。","教授力学的王庆勇老师是一位幽默风趣，思维发散的老师，上课时很快就会调动起大家的求知欲望，讲解逻辑清晰，会让同学更多的自己探索知识的奥秘；教授光学的李金环老师，课堂轻松但节奏紧凑，知识点条理清晰，与同学们充分互动，往往在课堂上就把知识全部掌握了；教授量子力学的衣学喜老师，讲课充满激情，认真负责，知识点有重点，并且由浅入深等等。物理学院的老师们都特别亲切，对待学生也认真负责，大家课后也可以多多与老师们沟通。"],"style":"text-indent: 1.5em; "}],"images":[],"id":"intro/school/physics/physics","scopeData":{"@type":"general","uniq_id":"intro/school/physics/physics","title":"物理学介绍","digest":"为教育部批准备案的师范专业，学生毕业后可选择从事教师职业，也可选择继续攻读研究生，或选择从事其他职业。旨在立足东北，面向国家物理学基础研究人才需求，培养专业基础宽厚扎实、综合素质高、适合在物理学及相关的科学技术领域中从事科学研究的专门人才和","thumbs":["https://mp.innenu.com/img/inNENU.jpg"],"tags":["专业简介","主干课程","就业方向","优秀毕业生经验"]}}