/* eslint-disable line-comment-position */
import { existsSync, mkdirSync, writeFileSync } from "fs";

interface ClassConfig {
  class: string;
}

interface CategoryConfig {
  category: string;
  items: ClassConfig[];
}

interface PlanConfig {
  plan: string;
  items: CategoryConfig[];
}

interface ProvinceConfig {
  province: string;
  items: PlanConfig[];
}

interface YearConfig {
  year: string;
  items: ProvinceConfig[];
}

type EnrollPlanConfig = YearConfig[];

class Dsy {
  private config: EnrollPlanConfig;
  constructor() {
    this.config = [];
  }

  /**
   *
   * @param {string} id
   * @param {string[]} content
   */
  add(id: string, content: string[]): void {
    const ids = id.split("_").map((item) => Number(item));

    // year
    if (ids.length === 1) {
      content.forEach((item, index) => {
        if (!this.config[index]) this.config[index] = { year: "", items: [] };

        this.config[index].year = item;
      });
    }
    // province
    else if (ids.length === 2) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      content.forEach((item, index) => {
        if (!this.config[ids[1]].items[index])
          this.config[ids[1]].items[index] = { province: "", items: [] };

        this.config[ids[1]].items[index].province = item;
      });
    }
    // plan
    else if (ids.length === 3) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]])
        this.config[ids[1]].items[ids[2]] = { province: "", items: [] };

      content.forEach((item, index) => {
        if (!this.config[ids[1]].items[ids[2]].items[index])
          this.config[ids[1]].items[ids[2]].items[index] = {
            plan: "",
            items: [],
          };

        this.config[ids[1]].items[ids[2]].items[index].plan = item;
      });
    }
    // category
    else if (ids.length === 4) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]])
        this.config[ids[1]].items[ids[2]] = { province: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]].items[ids[3]])
        this.config[ids[1]].items[ids[2]].items[ids[3]] = {
          plan: "",
          items: [],
        };

      content.forEach((item, index) => {
        if (!this.config[ids[1]].items[ids[2]].items[ids[3]].items[index])
          this.config[ids[1]].items[ids[2]].items[ids[3]].items[index] = {
            category: "",
            items: [],
          };

        this.config[ids[1]].items[ids[2]].items[ids[3]].items[index].category =
          item;
      });
    }
    // class
    else if (ids.length === 5) {
      if (!this.config[ids[1]]) this.config[ids[1]] = { year: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]])
        this.config[ids[1]].items[ids[2]] = { province: "", items: [] };

      if (!this.config[ids[1]].items[ids[2]].items[ids[3]])
        this.config[ids[1]].items[ids[2]].items[ids[3]] = {
          plan: "",
          items: [],
        };

      if (!this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]])
        this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]] = {
          category: "",
          items: [],
        };

      content.forEach((item, index) => {
        if (
          !this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]].items[
            index
          ]
        )
          this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]].items[
            index
          ] = { class: "" };

        this.config[ids[1]].items[ids[2]].items[ids[3]].items[ids[4]].items[
          index
        ].class = item;
      });
    }
  }

  exportJSON(): string {
    return JSON.stringify(this.config);
  }
}

const dsy = new Dsy();

//dsy.add('0',['2018','2017','2016']);
//dsy.add('0',['2020']);
dsy.add("0", ["2021"]);
//dsy.add('0',['2019']);
//dsy.add('0',['2018','2017','2016','2015','2014']);

dsy.add("0_0", [
  "北京",
  "天津",
  "河北",
  "山西",
  "内蒙古",
  "辽宁",
  "吉林",
  "黑龙江",
  "上海",
  "江苏",
  "浙江",
  "安徽",
  "福建",
  "江西",
  "山东",
  "河南",
  "湖北",
  "湖南",
  "广东",
  "广西",
  "海南",
  "重庆",
  "四川",
  "贵州",
  "云南",
  "西藏",
  "陕西",
  "甘肃",
  "青海",
  "宁夏",
  "新疆",
]);
//dsy.add('0_1',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_2',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_3',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_3',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);
//dsy.add('0_4',['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆']);

dsy.add("0_0_0", ["一般计划"]);
dsy.add("0_0_1", ["一般计划"]);
dsy.add("0_0_2", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //河北
dsy.add("0_0_3", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //山西
dsy.add("0_0_4", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //内蒙古
dsy.add("0_0_5", ["一般计划", "少数民族预科", "高校专项计划"]); //辽宁
dsy.add("0_0_6", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //吉
dsy.add("0_0_7", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //黑
dsy.add("0_0_8", ["一般计划"]);
dsy.add("0_0_9", ["一般计划"]); //苏
dsy.add("0_0_10", ["一般计划", "高校专项计划"]); //浙
dsy.add("0_0_11", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //皖
dsy.add("0_0_12", ["一般计划", "高校专项计划"]); //闽
dsy.add("0_0_13", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //赣
dsy.add("0_0_14", ["一般计划", "高校专项计划"]); //山东
dsy.add("0_0_15", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //豫
dsy.add("0_0_16", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //湖北
dsy.add("0_0_17", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //湖南
dsy.add("0_0_18", ["一般计划", "高校专项计划"]);
dsy.add("0_0_19", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //广西
dsy.add("0_0_20", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //琼
dsy.add("0_0_21", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //重庆
dsy.add("0_0_22", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //四川
dsy.add("0_0_23", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //贵州
dsy.add("0_0_24", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //云南
dsy.add("0_0_25", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //西藏
dsy.add("0_0_26", ["一般计划", "国家专项计划", "高校专项计划", "优师专项"]); //陕西
dsy.add("0_0_27", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //甘肃
dsy.add("0_0_28", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //青海
dsy.add("0_0_29", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
]); //宁夏
dsy.add("0_0_30", [
  "一般计划",
  "少数民族预科",
  "国家专项计划",
  "高校专项计划",
  "优师专项",
  "南疆单列计划",
]);

/*
dsy.add('0_0_0',['一般计划']);
dsy.add('0_0_1',['一般计划']);
dsy.add('0_0_2',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_3',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_4',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_5',['一般计划','少数民族预科','高校专项计划']);
dsy.add('0_0_6',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_7',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_8',['一般计划']);
dsy.add('0_0_9',['一般计划']);
dsy.add('0_0_10',['一般计划','高校专项计划']);
dsy.add('0_0_11',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_12',['一般计划','高校专项计划']);
dsy.add('0_0_13',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_14',['一般计划','高校专项计划']);
dsy.add('0_0_15',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_16',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_17',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_18',['一般计划','高校专项计划']);
dsy.add('0_0_19',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_20',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_21',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_22',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_23',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_24',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_25',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_26',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_0_27',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_28',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_29',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_0_30',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
*/

/*
dsy.add('0_1_0',['一般计划']);
dsy.add('0_1_1',['一般计划']);
dsy.add('0_1_2',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_3',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_4',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_5',['一般计划','少数民族预科','高校专项计划']);
dsy.add('0_1_6',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_7',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_8',['一般计划']);
dsy.add('0_1_9',['一般计划']);
dsy.add('0_1_10',['一般计划','高校专项计划']);
dsy.add('0_1_11',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_12',['一般计划','高校专项计划']);
dsy.add('0_1_13',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_14',['一般计划','高校专项计划']);
dsy.add('0_1_15',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_16',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_17',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_18',['一般计划','高校专项计划']);
dsy.add('0_1_19',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_20',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_21',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_22',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_23',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_24',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_25',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_26',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_1_27',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_28',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_29',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_1_30',['一般计划','少数民族预科','国家专项计划','南疆单列计划','高校专项计划']);


dsy.add('0_2_0',['一般计划']);
dsy.add('0_2_1',['一般计划']);
dsy.add('0_2_2',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_3',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_4',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_5',['一般计划','少数民族预科','高校专项计划']);
dsy.add('0_2_6',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_7',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_8',['一般计划']);
dsy.add('0_2_9',['一般计划']);
dsy.add('0_2_10',['一般计划','高校专项计划']);
dsy.add('0_2_11',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_12',['一般计划','高校专项计划']);
dsy.add('0_2_13',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_14',['一般计划','高校专项计划']);
dsy.add('0_2_15',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_16',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_17',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_18',['一般计划','高校专项计划']);
dsy.add('0_2_19',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_20',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_21',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_22',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_23',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_24',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_25',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_26',['一般计划','国家专项计划','高校专项计划']);
dsy.add('0_2_27',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_28',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_29',['一般计划','少数民族预科','国家专项计划','高校专项计划']);
dsy.add('0_2_30',['一般计划','少数民族预科','国家专项计划','南疆单列计划','高校专项计划']);

dsy.add('0_3_0',['一般计划']);
dsy.add('0_3_1',['一般计划']);
dsy.add('0_3_2',['一般计划','国家计划']);
dsy.add('0_3_3',['一般计划','国家计划']);
dsy.add('0_3_4',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_5',['一般计划','少数民族预科']);
dsy.add('0_3_6',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_7',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_8',['一般计划']);
dsy.add('0_3_9',['一般计划']);
dsy.add('0_3_10',['一般计划']);
dsy.add('0_3_11',['一般计划','国家计划']);
dsy.add('0_3_12',['一般计划']);
dsy.add('0_3_13',['一般计划','国家计划']);
dsy.add('0_3_14',['一般计划']);
dsy.add('0_3_15',['一般计划','国家计划']);
dsy.add('0_3_16',['一般计划','国家计划']);
dsy.add('0_3_17',['一般计划','国家计划']);
dsy.add('0_3_18',['一般计划']);
dsy.add('0_3_19',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_20',['一般计划','国家计划']);
dsy.add('0_3_21',['一般计划','国家计划']);
dsy.add('0_3_22',['一般计划','国家计划']);
dsy.add('0_3_23',['一般计划','国家计划']);
dsy.add('0_3_24',['一般计划','国家计划']);
dsy.add('0_3_25',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_26',['一般计划','国家计划']);
dsy.add('0_3_27',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_28',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_29',['一般计划','少数民族预科','国家计划']);
dsy.add('0_3_30',['一般计划','少数民族预科','国家计划','南疆计划']);

*/

dsy.add("0_0_0_0", ["文史理工类"]); //京
dsy.add("0_0_1_0", ["文史理工类", "艺术类"]); //津
dsy.add("0_0_2_0", ["文史理工类", "艺术类", "体育类"]); //河北
dsy.add("0_0_2_1", ["文史理工类"]);
dsy.add("0_0_2_2", ["文史理工类"]);
dsy.add("0_0_2_3", ["文史理工类"]);

dsy.add("0_0_3_0", ["文史理工类", "艺术类", "体育类"]); //山西
dsy.add("0_0_3_1", ["文史理工类"]);
dsy.add("0_0_3_2", ["文史理工类"]);
dsy.add("0_0_3_3", ["文史理工类"]);

dsy.add("0_0_4_0", ["文史理工类", "艺术类", "体育类"]); //内蒙古
dsy.add("0_0_4_1", ["文史理工类"]);
dsy.add("0_0_4_2", ["文史理工类"]);
dsy.add("0_0_4_3", ["文史理工类"]);
dsy.add("0_0_4_4", ["文史理工类"]);

dsy.add("0_0_5_0", ["文史理工类", "艺术类", "体育类"]); //辽宁
dsy.add("0_0_5_1", ["文史理工类"]);
dsy.add("0_0_5_2", ["文史理工类"]);

dsy.add("0_0_6_0", ["文史理工类", "艺术类", "体育类"]); //吉林
dsy.add("0_0_6_1", ["文史理工类"]);
dsy.add("0_0_6_2", ["文史理工类"]);
dsy.add("0_0_6_3", ["文史理工类"]);
dsy.add("0_0_6_4", ["文史理工类"]);

dsy.add("0_0_7_0", ["文史理工类", "艺术类", "体育类"]); //黑
dsy.add("0_0_7_1", ["文史理工类"]);
dsy.add("0_0_7_2", ["文史理工类"]);
dsy.add("0_0_7_3", ["文史理工类"]);
dsy.add("0_0_7_4", ["文史理工类"]);

dsy.add("0_0_8_0", ["文史理工类"]); //沪

dsy.add("0_0_9_0", ["文史理工类", "艺术类"]); //苏

dsy.add("0_0_10_0", ["文史理工类"]); //浙
dsy.add("0_0_10_1", ["文史理工类"]);

dsy.add("0_0_11_0", ["文史理工类", "体育类"]); //皖
dsy.add("0_0_11_1", ["文史理工类"]);
dsy.add("0_0_11_2", ["文史理工类"]);
dsy.add("0_0_11_3", ["文史理工类"]);

dsy.add("0_0_12_0", ["文史理工类", "艺术类"]); //闽
dsy.add("0_0_12_1", ["文史理工类"]);

dsy.add("0_0_13_0", ["文史理工类"]); //赣
dsy.add("0_0_13_1", ["文史理工类"]);
dsy.add("0_0_13_2", ["文史理工类"]);
dsy.add("0_0_13_3", ["文史理工类"]);

dsy.add("0_0_14_0", ["文史理工类", "艺术类", "体育类"]); //山东
dsy.add("0_0_14_1", ["文史理工类"]);

dsy.add("0_0_15_0", ["文史理工类", "艺术类", "体育类"]); //河南
dsy.add("0_0_15_1", ["文史理工类"]);
dsy.add("0_0_15_2", ["文史理工类"]);
dsy.add("0_0_15_3", ["文史理工类"]);

dsy.add("0_0_16_0", ["文史理工类", "艺术类", "体育类"]); //湖北
dsy.add("0_0_16_1", ["文史理工类"]);
dsy.add("0_0_16_2", ["文史理工类"]);
dsy.add("0_0_16_3", ["文史理工类"]);

dsy.add("0_0_17_0", ["文史理工类", "艺术类", "体育类"]); //湖南
dsy.add("0_0_17_1", ["文史理工类"]);
dsy.add("0_0_17_2", ["文史理工类"]);
dsy.add("0_0_17_3", ["文史理工类"]);

dsy.add("0_0_18_0", ["文史理工类", "艺术类"]); //广东
dsy.add("0_0_18_1", ["文史理工类"]);

dsy.add("0_0_19_0", ["文史理工类"]); //广西
dsy.add("0_0_19_1", ["文史理工类"]);
dsy.add("0_0_19_2", ["文史理工类"]);
dsy.add("0_0_19_3", ["文史理工类"]);
dsy.add("0_0_19_4", ["文史理工类"]);

dsy.add("0_0_20_0", ["文史理工类", "艺术类"]); //海南
dsy.add("0_0_20_1", ["文史理工类"]);
dsy.add("0_0_20_2", ["文史理工类"]);
dsy.add("0_0_20_3", ["文史理工类"]);

dsy.add("0_0_21_0", ["文史理工类"]); // 重庆
dsy.add("0_0_21_1", ["文史理工类"]);
dsy.add("0_0_21_2", ["文史理工类"]);
dsy.add("0_0_21_3", ["文史理工类"]);

dsy.add("0_0_22_0", ["文史理工类", "艺术类"]); //四川
dsy.add("0_0_22_1", ["文史理工类"]);
dsy.add("0_0_22_2", ["文史理工类"]);
dsy.add("0_0_22_3", ["文史理工类"]);
dsy.add("0_0_22_4", ["文史理工类"]);

dsy.add("0_0_23_0", ["文史理工类"]); //贵州
dsy.add("0_0_23_1", ["文史理工类"]);
dsy.add("0_0_23_2", ["文史理工类"]);
dsy.add("0_0_23_3", ["文史理工类"]);
dsy.add("0_0_23_4", ["文史理工类"]);

dsy.add("0_0_24_0", ["文史理工类"]); //云南
dsy.add("0_0_24_1", ["文史理工类"]);
dsy.add("0_0_24_2", ["文史理工类"]);
dsy.add("0_0_24_3", ["文史理工类"]);
dsy.add("0_0_24_4", ["文史理工类"]);

dsy.add("0_0_25_0", ["文史理工类"]); //西藏
dsy.add("0_0_25_1", ["文史理工类"]);
dsy.add("0_0_25_2", ["文史理工类"]);
dsy.add("0_0_25_3", ["文史理工类"]);
dsy.add("0_0_25_4", ["文史理工类"]);

dsy.add("0_0_26_0", ["文史理工类", "体育类"]); //陕西
dsy.add("0_0_26_1", ["文史理工类"]);
dsy.add("0_0_26_2", ["文史理工类"]);
dsy.add("0_0_26_3", ["文史理工类"]);

dsy.add("0_0_27_0", ["文史理工类"]); //甘肃
dsy.add("0_0_27_1", ["文史理工类"]);
dsy.add("0_0_27_2", ["文史理工类"]);
dsy.add("0_0_27_3", ["文史理工类"]);
dsy.add("0_0_27_4", ["文史理工类"]);

dsy.add("0_0_28_0", ["文史理工类"]); //青海
dsy.add("0_0_28_1", ["文史理工类"]);
dsy.add("0_0_28_2", ["文史理工类"]);
dsy.add("0_0_28_3", ["文史理工类"]);
dsy.add("0_0_28_4", ["文史理工类"]);

dsy.add("0_0_29_0", ["文史理工类"]); //宁夏
dsy.add("0_0_29_1", ["文史理工类"]);
dsy.add("0_0_29_2", ["文史理工类"]);
dsy.add("0_0_29_3", ["文史理工类"]);
dsy.add("0_0_29_4", ["文史理工类"]);

dsy.add("0_0_30_0", ["文史理工类"]); //新疆
dsy.add("0_0_30_1", ["文史理工类"]);
dsy.add("0_0_30_2", ["文史理工类"]);
dsy.add("0_0_30_3", ["文史理工类"]);
dsy.add("0_0_30_4", ["文史理工类"]);
dsy.add("0_0_30_5", ["文史理工类"]);

/*
dsy.add('0_0_0_0',['文史理工类','艺术类']);
dsy.add('0_0_1_0',['文史理工类','艺术类']);
dsy.add('0_0_2_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_2_1',['文史理工类']);
dsy.add('0_0_2_2',['文史理工类']);
dsy.add('0_0_3_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_3_1',['文史理工类']);
dsy.add('0_0_3_2',['文史理工类']);
dsy.add('0_0_4_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_4_1',['文史理工类']);
dsy.add('0_0_4_2',['文史理工类']);
dsy.add('0_0_4_3',['文史理工类']);
dsy.add('0_0_5_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_5_1',['文史理工类']);
dsy.add('0_0_5_2',['文史理工类']);
dsy.add('0_0_6_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_6_1',['文史理工类']);
dsy.add('0_0_6_2',['文史理工类']);
dsy.add('0_0_6_3',['文史理工类']);
dsy.add('0_0_7_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_7_1',['文史理工类']);
dsy.add('0_0_7_2',['文史理工类']);
dsy.add('0_0_7_3',['文史理工类']);
dsy.add('0_0_8_0',['文史理工类']);
dsy.add('0_0_9_0',['文史理工类','艺术类']);
dsy.add('0_0_10_0',['文史理工类']);
dsy.add('0_0_10_1',['文史理工类']);
dsy.add('0_0_11_0',['文史理工类']);
dsy.add('0_0_11_1',['文史理工类']);
dsy.add('0_0_11_2',['文史理工类']);
dsy.add('0_0_12_0',['文史理工类']);
dsy.add('0_0_12_1',['文史理工类']);
dsy.add('0_0_13_0',['文史理工类']);
dsy.add('0_0_13_1',['文史理工类']);
dsy.add('0_0_13_2',['文史理工类']);
dsy.add('0_0_14_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_14_1',['文史理工类']);
dsy.add('0_0_15_0',['文史理工类','艺术类','体育类']);
dsy.add('0_0_15_1',['文史理工类']);
dsy.add('0_0_15_2',['文史理工类']);
dsy.add('0_0_16_0',['文史理工类','艺术类']);
dsy.add('0_0_16_1',['文史理工类']);
dsy.add('0_0_16_2',['文史理工类']);
dsy.add('0_0_17_0',['文史理工类','艺术类']);
dsy.add('0_0_17_1',['文史理工类']);
dsy.add('0_0_17_2',['文史理工类']);
dsy.add('0_0_18_0',['文史理工类','艺术类']);
dsy.add('0_0_18_1',['文史理工类']);
dsy.add('0_0_19_0',['文史理工类']);
dsy.add('0_0_19_1',['文史理工类']);
dsy.add('0_0_19_2',['文史理工类']);
dsy.add('0_0_19_3',['文史理工类']);
dsy.add('0_0_20_0',['文史理工类','艺术类']);
dsy.add('0_0_20_1',['文史理工类']);
dsy.add('0_0_20_2',['文史理工类']);
dsy.add('0_0_21_0',['文史理工类']);
dsy.add('0_0_21_1',['文史理工类']);
dsy.add('0_0_21_2',['文史理工类']);
dsy.add('0_0_22_0',['文史理工类','艺术类']);
dsy.add('0_0_22_1',['文史理工类']);
dsy.add('0_0_22_2',['文史理工类']);
dsy.add('0_0_22_3',['文史理工类']);
dsy.add('0_0_23_0',['文史理工类']);
dsy.add('0_0_23_1',['文史理工类']);
dsy.add('0_0_23_2',['文史理工类']);
dsy.add('0_0_23_3',['文史理工类']);
dsy.add('0_0_24_0',['文史理工类']);
dsy.add('0_0_24_1',['文史理工类']);
dsy.add('0_0_24_2',['文史理工类']);
dsy.add('0_0_24_3',['文史理工类']);
dsy.add('0_0_25_0',['文史理工类']);
dsy.add('0_0_25_1',['文史理工类']);
dsy.add('0_0_25_2',['文史理工类']);
dsy.add('0_0_25_3',['文史理工类']);
dsy.add('0_0_26_0',['文史理工类','体育类']);
dsy.add('0_0_26_1',['文史理工类']);
dsy.add('0_0_26_2',['文史理工类']);
dsy.add('0_0_27_0',['文史理工类']);
dsy.add('0_0_27_1',['文史理工类']);
dsy.add('0_0_27_2',['文史理工类']);
dsy.add('0_0_27_3',['文史理工类']);
dsy.add('0_0_28_0',['文史理工类']);
dsy.add('0_0_28_1',['文史理工类']);
dsy.add('0_0_28_2',['文史理工类']);
dsy.add('0_0_28_3',['文史理工类']);
dsy.add('0_0_29_0',['文史理工类']);
dsy.add('0_0_29_1',['文史理工类']);
dsy.add('0_0_29_2',['文史理工类']);
dsy.add('0_0_29_3',['文史理工类']);
dsy.add('0_0_30_0',['文史理工类']);
dsy.add('0_0_30_1',['文史理工类']);
dsy.add('0_0_30_2',['文史理工类']);
dsy.add('0_0_30_3',['文史理工类']);
*/

/*

dsy.add('0_1_0_0',['文史理工类','艺术类']);
dsy.add('0_1_1_0',['文史理工类','艺术类']);
dsy.add('0_1_2_0',['文史理工类','艺术类']);
dsy.add('0_1_2_1',['文史理工类']);
dsy.add('0_1_2_2',['文史理工类']);
dsy.add('0_1_3_0',['文史理工类']);
dsy.add('0_1_3_1',['文史理工类']);
dsy.add('0_1_3_2',['文史理工类']);
dsy.add('0_1_4_0',['文史理工类','艺术类']);
dsy.add('0_1_4_1',['文史理工类']);
dsy.add('0_1_4_2',['文史理工类']);
dsy.add('0_1_4_3',['文史理工类']);
dsy.add('0_1_5_0',['文史理工类','艺术类']);
dsy.add('0_1_5_1',['文史理工类']);
dsy.add('0_1_5_2',['文史理工类']);
dsy.add('0_1_6_0',['文史理工类','艺术类']);
dsy.add('0_1_6_1',['文史理工类']);
dsy.add('0_1_6_2',['文史理工类']);
dsy.add('0_1_6_3',['文史理工类']);
dsy.add('0_1_7_0',['文史理工类','艺术类']);
dsy.add('0_1_7_1',['文史理工类']);
dsy.add('0_1_7_2',['文史理工类']);
dsy.add('0_1_7_3',['文史理工类']);
dsy.add('0_1_8_0',['文史理工类']);
dsy.add('0_1_9_0',['文史理工类','艺术类']);
dsy.add('0_1_10_0',['文史理工类']);
dsy.add('0_1_10_1',['文史理工类']);
dsy.add('0_1_11_0',['文史理工类']);
dsy.add('0_1_11_1',['文史理工类']);
dsy.add('0_1_11_2',['文史理工类']);
dsy.add('0_1_12_0',['文史理工类']);
dsy.add('0_1_12_1',['文史理工类']);
dsy.add('0_1_13_0',['文史理工类']);
dsy.add('0_1_13_1',['文史理工类']);
dsy.add('0_1_13_2',['文史理工类']);
dsy.add('0_1_14_0',['文史理工类','艺术类']);
dsy.add('0_1_14_1',['文史理工类']);
dsy.add('0_1_15_0',['文史理工类','艺术类']);
dsy.add('0_1_15_1',['文史理工类']);
dsy.add('0_1_15_2',['文史理工类']);
dsy.add('0_1_16_0',['文史理工类']);
dsy.add('0_1_16_1',['文史理工类']);
dsy.add('0_1_16_2',['文史理工类']);
dsy.add('0_1_17_0',['文史理工类','艺术类']);
dsy.add('0_1_17_1',['文史理工类']);
dsy.add('0_1_17_2',['文史理工类']);
dsy.add('0_1_18_0',['文史理工类','艺术类']);
dsy.add('0_1_18_1',['文史理工类']);
dsy.add('0_1_19_0',['文史理工类']);
dsy.add('0_1_19_1',['文史理工类']);
dsy.add('0_1_19_2',['文史理工类']);
dsy.add('0_1_19_3',['文史理工类']);
dsy.add('0_1_20_0',['文史理工类','艺术类']);
dsy.add('0_1_20_1',['文史理工类']);
dsy.add('0_1_20_2',['文史理工类']);
dsy.add('0_1_21_0',['文史理工类']);
dsy.add('0_1_21_1',['文史理工类']);
dsy.add('0_1_21_2',['文史理工类']);
dsy.add('0_1_22_0',['文史理工类','艺术类']);
dsy.add('0_1_22_1',['文史理工类']);
dsy.add('0_1_22_2',['文史理工类']);
dsy.add('0_1_22_3',['文史理工类']);
dsy.add('0_1_23_0',['文史理工类']);
dsy.add('0_1_23_1',['文史理工类']);
dsy.add('0_1_23_2',['文史理工类']);
dsy.add('0_1_23_3',['文史理工类']);
dsy.add('0_1_24_0',['文史理工类']);
dsy.add('0_1_24_1',['文史理工类']);
dsy.add('0_1_24_2',['文史理工类']);
dsy.add('0_1_24_3',['文史理工类']);
dsy.add('0_1_25_0',['文史理工类']);
dsy.add('0_1_25_1',['文史理工类']);
dsy.add('0_1_25_2',['文史理工类']);
dsy.add('0_1_25_3',['文史理工类']);
dsy.add('0_1_26_0',['文史理工类']);
dsy.add('0_1_26_1',['文史理工类']);
dsy.add('0_1_26_2',['文史理工类']);
dsy.add('0_1_27_0',['文史理工类']);
dsy.add('0_1_27_1',['文史理工类']);
dsy.add('0_1_27_2',['文史理工类']);
dsy.add('0_1_27_3',['文史理工类']);
dsy.add('0_1_28_0',['文史理工类']);
dsy.add('0_1_28_1',['文史理工类']);
dsy.add('0_1_28_2',['文史理工类']);
dsy.add('0_1_28_3',['文史理工类']);
dsy.add('0_1_29_0',['文史理工类']);
dsy.add('0_1_29_1',['文史理工类']);
dsy.add('0_1_29_2',['文史理工类']);
dsy.add('0_1_29_3',['文史理工类']);
dsy.add('0_1_30_0',['文史理工类']);
dsy.add('0_1_30_1',['文史理工类']);
dsy.add('0_1_30_2',['文史理工类']);
dsy.add('0_1_30_3',['文史理工类']);
dsy.add('0_1_30_4',['文史理工类']);


dsy.add('0_2_0_0',['文史理工类','艺术类']);
dsy.add('0_2_1_0',['文史理工类','艺术类']);
dsy.add('0_2_2_0',['文史理工类','艺术类']);
dsy.add('0_2_2_1',['文史理工类']);
dsy.add('0_2_2_2',['文史理工类']);
dsy.add('0_2_3_0',['文史理工类']);
dsy.add('0_2_3_1',['文史理工类']);
dsy.add('0_2_3_2',['文史理工类']);
dsy.add('0_2_4_0',['文史理工类','艺术类']);
dsy.add('0_2_4_1',['文史理工类']);
dsy.add('0_2_4_2',['文史理工类']);
dsy.add('0_2_4_3',['文史理工类']);
dsy.add('0_2_5_0',['文史理工类','艺术类']);
dsy.add('0_2_5_1',['文史理工类']);
dsy.add('0_2_5_2',['文史理工类']);
dsy.add('0_2_6_0',['文史理工类','艺术类']);
dsy.add('0_2_6_1',['文史理工类']);
dsy.add('0_2_6_2',['文史理工类']);
dsy.add('0_2_6_3',['文史理工类']);
dsy.add('0_2_7_0',['文史理工类','艺术类']);
dsy.add('0_2_7_1',['文史理工类']);
dsy.add('0_2_7_2',['文史理工类']);
dsy.add('0_2_7_3',['文史理工类']);
dsy.add('0_2_8_0',['文史理工类']);
dsy.add('0_2_9_0',['文史理工类','艺术类']);
dsy.add('0_2_10_0',['文史理工类']);
dsy.add('0_2_10_1',['文史理工类']);
dsy.add('0_2_11_0',['文史理工类']);
dsy.add('0_2_11_1',['文史理工类']);
dsy.add('0_2_11_2',['文史理工类']);
dsy.add('0_2_12_0',['文史理工类']);
dsy.add('0_2_12_1',['文史理工类']);
dsy.add('0_2_13_0',['文史理工类']);
dsy.add('0_2_13_1',['文史理工类']);
dsy.add('0_2_13_2',['文史理工类']);
dsy.add('0_2_14_0',['文史理工类','艺术类']);
dsy.add('0_2_14_1',['文史理工类']);
dsy.add('0_2_15_0',['文史理工类','艺术类']);
dsy.add('0_2_15_1',['文史理工类']);
dsy.add('0_2_15_2',['文史理工类']);
dsy.add('0_2_16_0',['文史理工类','艺术类']);
dsy.add('0_2_16_1',['文史理工类']);
dsy.add('0_2_16_2',['文史理工类']);
dsy.add('0_2_17_0',['文史理工类','艺术类']);
dsy.add('0_2_17_1',['文史理工类']);
dsy.add('0_2_17_2',['文史理工类']);
dsy.add('0_2_18_0',['文史理工类','艺术类']);
dsy.add('0_2_18_1',['文史理工类']);
dsy.add('0_2_19_0',['文史理工类']);
dsy.add('0_2_19_1',['文史理工类']);
dsy.add('0_2_19_2',['文史理工类']);
dsy.add('0_2_19_3',['文史理工类']);
dsy.add('0_2_20_0',['文史理工类','艺术类']);
dsy.add('0_2_20_1',['文史理工类']);
dsy.add('0_2_20_2',['文史理工类']);
dsy.add('0_2_21_0',['文史理工类']);
dsy.add('0_2_21_1',['文史理工类']);
dsy.add('0_2_21_2',['文史理工类']);
dsy.add('0_2_22_0',['文史理工类','艺术类']);
dsy.add('0_2_22_1',['文史理工类']);
dsy.add('0_2_22_2',['文史理工类']);
dsy.add('0_2_22_3',['文史理工类']);
dsy.add('0_2_23_0',['文史理工类']);
dsy.add('0_2_23_1',['文史理工类']);
dsy.add('0_2_23_2',['文史理工类']);
dsy.add('0_2_23_3',['文史理工类']);
dsy.add('0_2_24_0',['文史理工类']);
dsy.add('0_2_24_1',['文史理工类']);
dsy.add('0_2_24_2',['文史理工类']);
dsy.add('0_2_24_3',['文史理工类']);
dsy.add('0_2_25_0',['文史理工类']);
dsy.add('0_2_25_1',['文史理工类']);
dsy.add('0_2_25_2',['文史理工类']);
dsy.add('0_2_25_3',['文史理工类']);
dsy.add('0_2_26_0',['文史理工类']);
dsy.add('0_2_26_1',['文史理工类']);
dsy.add('0_2_26_2',['文史理工类']);
dsy.add('0_2_27_0',['文史理工类']);
dsy.add('0_2_27_1',['文史理工类']);
dsy.add('0_2_27_2',['文史理工类']);
dsy.add('0_2_27_3',['文史理工类']);
dsy.add('0_2_28_0',['文史理工类']);
dsy.add('0_2_28_1',['文史理工类']);
dsy.add('0_2_28_2',['文史理工类']);
dsy.add('0_2_28_3',['文史理工类']);
dsy.add('0_2_29_0',['文史理工类']);
dsy.add('0_2_29_1',['文史理工类']);
dsy.add('0_2_29_2',['文史理工类']);
dsy.add('0_2_29_3',['文史理工类']);
dsy.add('0_2_30_0',['文史理工类']);
dsy.add('0_2_30_1',['文史理工类']);
dsy.add('0_2_30_2',['文史理工类']);
dsy.add('0_2_30_3',['文史理工类']);
dsy.add('0_2_30_4',['文史理工类']);

dsy.add('0_3_0_0',['文史理工类']);
dsy.add('0_3_1_0',['文史理工类','艺术类']);
dsy.add('0_3_2_0',['文史理工类','艺术类']);
dsy.add('0_3_2_1',['文史理工类']);
dsy.add('0_3_3_0',['文史理工类']);
dsy.add('0_3_3_1',['文史理工类']);
dsy.add('0_3_4_0',['文史理工类','艺术类','体育类']);
dsy.add('0_3_4_1',['文史理工类']);
dsy.add('0_3_4_2',['文史理工类']);
dsy.add('0_3_5_0',['文史理工类','艺术类','体育类']);
dsy.add('0_3_5_1',['文史理工类']);
dsy.add('0_3_6_0',['文史理工类','艺术类','体育类']);
dsy.add('0_3_6_1',['文史理工类']);
dsy.add('0_3_6_2',['文史理工类']);
dsy.add('0_3_7_0',['文史理工类','艺术类','体育类']);
dsy.add('0_3_7_1',['文史理工类']);
dsy.add('0_3_7_2',['文史理工类']);
dsy.add('0_3_8_0',['文史理工类']);
dsy.add('0_3_9_0',['文史理工类','艺术类']);
dsy.add('0_3_10_0',['文史理工类']);
dsy.add('0_3_11_0',['文史理工类']);
dsy.add('0_3_11_1',['文史理工类']);
dsy.add('0_3_12_0',['文史理工类']);
dsy.add('0_3_13_0',['文史理工类']);
dsy.add('0_3_13_1',['文史理工类']);
dsy.add('0_3_14_0',['文史理工类','艺术类','体育类']);
dsy.add('0_3_15_0',['文史理工类','艺术类']);
dsy.add('0_3_15_1',['文史理工类']);
dsy.add('0_3_16_0',['文史理工类','艺术类']);
dsy.add('0_3_16_1',['文史理工类']);
dsy.add('0_3_17_0',['文史理工类']);
dsy.add('0_3_17_1',['文史理工类']);
dsy.add('0_3_18_0',['文史理工类']);
dsy.add('0_3_19_0',['文史理工类']);
dsy.add('0_3_19_1',['文史理工类']);
dsy.add('0_3_19_2',['文史理工类']);
dsy.add('0_3_20_0',['文史理工类','艺术类']);
dsy.add('0_3_20_1',['文史理工类']);
dsy.add('0_3_21_0',['文史理工类']);
dsy.add('0_3_21_1',['文史理工类']);
dsy.add('0_3_22_0',['文史理工类','体育类']);
dsy.add('0_3_22_1',['文史理工类']);
dsy.add('0_3_23_0',['文史理工类']);
dsy.add('0_3_23_1',['文史理工类']);
dsy.add('0_3_24_0',['文史理工类']);
dsy.add('0_3_24_1',['文史理工类']);
dsy.add('0_3_25_0',['文史理工类']);
dsy.add('0_3_25_1',['文史理工类']);
dsy.add('0_3_25_2',['文史理工类']);
dsy.add('0_3_26_0',['文史理工类']);
dsy.add('0_3_26_1',['文史理工类']);
dsy.add('0_3_27_0',['文史理工类']);
dsy.add('0_3_27_1',['文史理工类']);
dsy.add('0_3_27_2',['文史理工类']);
dsy.add('0_3_28_0',['文史理工类']);
dsy.add('0_3_28_1',['文史理工类']);
dsy.add('0_3_28_2',['文史理工类']);
dsy.add('0_3_29_0',['文史理工类']);
dsy.add('0_3_29_1',['文史理工类']);
dsy.add('0_3_29_2',['文史理工类']);
dsy.add('0_3_30_0',['文史理工类']);
dsy.add('0_3_30_1',['文史理工类']);
dsy.add('0_3_30_2',['文史理工类']);
dsy.add('0_3_30_3',['文史理工类']);

*/

dsy.add("0_0_0_0_0", ["综合改革"]);

dsy.add("0_0_1_0_0", ["综合改革"]);
dsy.add("0_0_1_0_1", ["艺术(不分文理)"]);

dsy.add("0_0_2_0_0", ["历史类", "物理类"]);
dsy.add("0_0_2_0_1", ["艺术(历史类)", "艺术(物理类)", "艺术(不分科目类)"]);
dsy.add("0_0_2_0_2", ["体育(历史类)", "体育(物理类)"]);
dsy.add("0_0_2_1_0", ["历史类", "物理类"]);
dsy.add("0_0_2_2_0", ["历史类", "物理类"]);
dsy.add("0_0_2_3_0", ["历史类", "物理类"]);

dsy.add("0_0_3_0_0", ["文史", "理工"]);
dsy.add("0_0_3_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_3_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_3_1_0", ["文史", "理工"]);
dsy.add("0_0_3_2_0", ["文史", "理工"]);
dsy.add("0_0_3_3_0", ["文史", "理工"]);

dsy.add("0_0_4_0_0", ["文史", "理工"]); //内蒙古
dsy.add("0_0_4_0_1", ["艺术(文)", "艺术(理)", "艺术(不分文理)"]);
dsy.add("0_0_4_0_2", ["体育(不分文理)"]);
dsy.add("0_0_4_1_0", ["文史", "理工"]);
dsy.add("0_0_4_2_0", ["文史", "理工"]);
dsy.add("0_0_4_3_0", ["文史", "理工"]);
dsy.add("0_0_4_4_0", ["文史", "理工"]);

dsy.add("0_0_5_0_0", ["历史类", "物理类"]); //辽宁
dsy.add("0_0_5_0_1", ["艺术(历史类)", "艺术(物理类)"]);
dsy.add("0_0_5_0_2", ["体育(历史类)", "体育(物理类)"]);
dsy.add("0_0_5_1_0", ["物理类"]);
dsy.add("0_0_5_2_0", ["历史类", "物理类"]);

dsy.add("0_0_6_0_0", ["文史", "理工"]); //吉林
dsy.add("0_0_6_0_1", ["艺术(文)", "艺术(理)"]);
dsy.add("0_0_6_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_6_1_0", ["文史", "理工"]);
dsy.add("0_0_6_2_0", ["理工"]);
dsy.add("0_0_6_3_0", ["文史", "理工"]);
dsy.add("0_0_6_4_0", ["文史", "理工"]);

dsy.add("0_0_7_0_0", ["文史", "理工"]); //黑龙江
dsy.add("0_0_7_0_1", ["艺术(文)", "艺术(理)"]);
dsy.add("0_0_7_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_7_1_0", ["文史", "理工"]);
dsy.add("0_0_7_2_0", ["文史", "理工"]);
dsy.add("0_0_7_3_0", ["文史", "理工"]);
dsy.add("0_0_7_4_0", ["文史", "理工"]);

dsy.add("0_0_8_0_0", ["综合改革"]);

dsy.add("0_0_9_0_0", ["历史类", "物理类"]); //江苏
dsy.add("0_0_9_0_1", ["艺术(历史类)", "艺术(物理类)"]);

dsy.add("0_0_10_0_0", ["综合改革"]);
dsy.add("0_0_10_1_0", ["综合改革"]);

dsy.add("0_0_11_0_0", ["文史", "理工"]); //安徽
dsy.add("0_0_11_0_1", ["体育(不分文理)"]);
dsy.add("0_0_11_1_0", ["文史", "理工"]);
dsy.add("0_0_11_2_0", ["文史", "理工"]);
dsy.add("0_0_11_3_0", ["文史", "理工"]);

dsy.add("0_0_12_0_0", ["历史类", "物理类"]);
dsy.add("0_0_12_0_1", ["艺术(历史类)"]);
dsy.add("0_0_12_1_0", ["历史类", "物理类"]);

dsy.add("0_0_13_0_0", ["文史", "理工"]); //江西
dsy.add("0_0_13_1_0", ["文史", "理工"]);
dsy.add("0_0_13_2_0", ["文史", "理工"]);
dsy.add("0_0_13_3_0", ["文史", "理工"]);

dsy.add("0_0_14_0_0", ["综合改革"]);
dsy.add("0_0_14_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_14_0_2", ["体育(不分文理)"]);
dsy.add("0_0_14_1_0", ["综合改革"]);

dsy.add("0_0_15_0_0", ["文史", "理工"]); //河南
dsy.add("0_0_15_0_1", ["艺术(文)", "艺术(理)"]);
dsy.add("0_0_15_0_2", ["体育(文)", "体育(理)"]);
dsy.add("0_0_15_1_0", ["文史", "理工"]);
dsy.add("0_0_15_2_0", ["文史", "理工"]);
dsy.add("0_0_15_3_0", ["文史", "理工"]);

dsy.add("0_0_16_0_0", ["历史类", "物理类"]);
dsy.add("0_0_16_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_16_0_2", ["体育(不分文理)"]);
dsy.add("0_0_16_1_0", ["历史类", "物理类"]);
dsy.add("0_0_16_2_0", ["物理类"]);
dsy.add("0_0_16_3_0", ["历史类", "物理类"]);

dsy.add("0_0_17_0_0", ["历史类", "物理类"]); //湖南
dsy.add("0_0_17_0_1", ["艺术(历史类)"]);
dsy.add("0_0_17_0_2", ["体育(历史类)", "体育(物理类)"]);
dsy.add("0_0_17_1_0", ["历史类", "物理类"]);
dsy.add("0_0_17_2_0", ["历史类", "物理类"]);
dsy.add("0_0_17_3_0", ["历史类", "物理类"]);

dsy.add("0_0_18_0_0", ["历史类", "物理类"]); //广东
dsy.add("0_0_18_0_1", ["艺术(不分科目类)"]);
dsy.add("0_0_18_1_0", ["物理类"]);

dsy.add("0_0_19_0_0", ["文史", "理工"]);
dsy.add("0_0_19_1_0", ["文史", "理工"]);
dsy.add("0_0_19_2_0", ["文史", "理工"]);
dsy.add("0_0_19_3_0", ["文史", "理工"]);
dsy.add("0_0_19_4_0", ["文史", "理工"]);

dsy.add("0_0_20_0_0", ["综合改革"]);
dsy.add("0_0_20_0_1", ["艺术(不分文理)"]);
dsy.add("0_0_20_1_0", ["综合改革"]);
dsy.add("0_0_20_2_0", ["综合改革"]);
dsy.add("0_0_20_3_0", ["综合改革"]);

dsy.add("0_0_21_0_0", ["历史类", "物理类"]); //重庆
dsy.add("0_0_21_1_0", ["历史类", "物理类"]);
dsy.add("0_0_21_2_0", ["历史类", "物理类"]);
dsy.add("0_0_21_3_0", ["历史类", "物理类"]);

dsy.add("0_0_22_0_0", ["文史", "理工"]); //四川
dsy.add("0_0_22_0_1", ["艺术(文)", "艺术(理)", "艺术(不分文理)"]);
dsy.add("0_0_22_1_0", ["文史", "理工"]);
dsy.add("0_0_22_2_0", ["文史", "理工"]);
dsy.add("0_0_22_3_0", ["文史", "理工"]);
dsy.add("0_0_22_4_0", ["文史", "理工"]);

dsy.add("0_0_23_0_0", ["文史", "理工"]);
dsy.add("0_0_23_1_0", ["文史", "理工"]);
dsy.add("0_0_23_2_0", ["文史", "理工"]);
dsy.add("0_0_23_3_0", ["文史", "理工"]);
dsy.add("0_0_23_4_0", ["文史", "理工"]);

dsy.add("0_0_24_0_0", ["文史", "理工"]);
dsy.add("0_0_24_1_0", ["文史", "理工"]);
dsy.add("0_0_24_2_0", ["文史", "理工"]);
dsy.add("0_0_24_3_0", ["文史", "理工"]);
dsy.add("0_0_24_4_0", ["文史", "理工"]);

dsy.add("0_0_25_0_0", ["文史", "理工"]); //西藏
dsy.add("0_0_25_1_0", ["文史", "理工"]);
dsy.add("0_0_25_2_0", ["文史", "理工"]);
dsy.add("0_0_25_3_0", ["文史", "理工"]);
dsy.add("0_0_25_4_0", ["文史", "理工"]);

dsy.add("0_0_26_0_0", ["文史", "理工"]);
dsy.add("0_0_26_0_1", ["体育(理)"]);
dsy.add("0_0_26_1_0", ["文史", "理工"]);
dsy.add("0_0_26_2_0", ["文史", "理工"]);
dsy.add("0_0_26_3_0", ["文史", "理工"]);

dsy.add("0_0_27_0_0", ["文史", "理工"]); //甘肃
dsy.add("0_0_27_1_0", ["文史", "理工"]);
dsy.add("0_0_27_2_0", ["文史", "理工"]);
dsy.add("0_0_27_3_0", ["文史", "理工"]);
dsy.add("0_0_27_4_0", ["文史", "理工"]);

dsy.add("0_0_28_0_0", ["文史", "理工"]); //青海
dsy.add("0_0_28_1_0", ["文史", "理工"]);
dsy.add("0_0_28_2_0", ["文史", "理工"]);
dsy.add("0_0_28_3_0", ["文史", "理工"]);
dsy.add("0_0_28_4_0", ["文史", "理工"]);

dsy.add("0_0_29_0_0", ["文史", "理工"]); //宁夏
dsy.add("0_0_29_1_0", ["文史", "理工"]);
dsy.add("0_0_29_2_0", ["文史", "理工"]);
dsy.add("0_0_29_3_0", ["文史", "理工"]);
dsy.add("0_0_29_4_0", ["文史", "理工"]);

dsy.add("0_0_30_0_0", ["文史", "理工"]); //新疆
dsy.add("0_0_30_1_0", ["文史", "理工"]);
dsy.add("0_0_30_2_0", ["文史", "理工"]);
dsy.add("0_0_30_3_0", ["文史", "理工"]);
dsy.add("0_0_30_4_0", ["文史", "理工"]);
dsy.add("0_0_30_5_0", ["文史", "理工"]);
/*
dsy.add('0_0_0_0_0',['文科','理科']);
dsy.add('0_0_0_0_1',['文科']);
dsy.add('0_0_1_0_0',['文科','理科']);
dsy.add('0_0_1_0_1',['文科','理科']);
dsy.add('0_0_2_0_0',['文科','理科']);
dsy.add('0_0_2_0_1',['综合']);
dsy.add('0_0_2_0_2',['文科','理科']);
dsy.add('0_0_2_1_0',['文科','理科']);
dsy.add('0_0_2_2_0',['文科','理科']);
dsy.add('0_0_3_0_0',['文科','理科']);
dsy.add('0_0_3_0_1',['综合']);
dsy.add('0_0_3_0_2',['文科','理科']);
dsy.add('0_0_3_1_0',['文科','理科']);
dsy.add('0_0_3_2_0',['文科','理科']);
dsy.add('0_0_4_0_0',['文科','理科','蒙授文科','蒙授理科']);
dsy.add('0_0_4_0_1',['综合']);
dsy.add('0_0_4_0_2',['综合']);
dsy.add('0_0_4_1_0',['文科','理科']);
dsy.add('0_0_4_2_0',['文科','理科']);
dsy.add('0_0_4_3_0',['文科','理科']);
dsy.add('0_0_5_0_0',['文科','理科']);
dsy.add('0_0_5_0_1',['文科','理科']);
dsy.add('0_0_5_0_2',['文科','理科']);
dsy.add('0_0_5_1_0',['理科']);
dsy.add('0_0_5_2_0',['文科','理科']);
dsy.add('0_0_6_0_0',['文科','理科']);
dsy.add('0_0_6_0_1',['文科','理科']);
dsy.add('0_0_6_0_2',['文科','理科']);
dsy.add('0_0_6_1_0',['文科','理科']);
dsy.add('0_0_6_2_0',['理科']);
dsy.add('0_0_6_3_0',['文科','理科']);
dsy.add('0_0_7_0_0',['文科','理科']);
dsy.add('0_0_7_0_1',['文科','理科','综合']);
dsy.add('0_0_7_0_2',['文科','理科']);
dsy.add('0_0_7_1_0',['文科','理科']);
dsy.add('0_0_7_2_0',['文科','理科']);
dsy.add('0_0_7_3_0',['文科','理科']);
dsy.add('0_0_8_0_0',['综合']);
dsy.add('0_0_9_0_0',['文科','理科']);
dsy.add('0_0_9_0_1',['综合']);
dsy.add('0_0_10_0_0',['综合']);
dsy.add('0_0_10_1_0',['综合']);
dsy.add('0_0_11_0_0',['文科','理科']);
dsy.add('0_0_11_1_0',['文科','理科']);
dsy.add('0_0_11_2_0',['文科','理科']);
dsy.add('0_0_12_0_0',['文科','理科']);
dsy.add('0_0_12_1_0',['文科','理科']);
dsy.add('0_0_13_0_0',['文科','理科']);
dsy.add('0_0_13_1_0',['文科','理科']);
dsy.add('0_0_13_2_0',['文科','理科']);
dsy.add('0_0_14_0_0',['文科','理科']);
dsy.add('0_0_14_0_1',['文科','理科']);
dsy.add('0_0_14_0_2',['理科']);
dsy.add('0_0_14_1_0',['文科','理科']);
dsy.add('0_0_15_0_0',['文科','理科']);
dsy.add('0_0_15_0_1',['文科','理科']);
dsy.add('0_0_15_0_2',['文科','理科']);
dsy.add('0_0_15_1_0',['文科','理科']);
dsy.add('0_0_15_2_0',['文科','理科']);
dsy.add('0_0_16_0_0',['文科','理科']);
dsy.add('0_0_16_0_1',['综合']);
dsy.add('0_0_16_1_0',['文科','理科']);
dsy.add('0_0_16_2_0',['文科','理科']);
dsy.add('0_0_17_0_0',['文科','理科']);
dsy.add('0_0_17_0_1',['文科','理科']);
dsy.add('0_0_17_1_0',['文科','理科']);
dsy.add('0_0_17_2_0',['文科','理科']);
dsy.add('0_0_18_0_0',['文科','理科']);
dsy.add('0_0_18_0_1',['综合']);
dsy.add('0_0_18_1_0',['理科']);
dsy.add('0_0_19_0_0',['文科','理科']);
dsy.add('0_0_19_1_0',['文科','理科']);
dsy.add('0_0_19_2_0',['文科','理科']);
dsy.add('0_0_19_3_0',['文科','理科']);
dsy.add('0_0_20_0_0',['文科','理科']);
dsy.add('0_0_20_0_1',['文科']);
dsy.add('0_0_20_1_0',['理科']);
dsy.add('0_0_20_2_0',['文科','理科']);
dsy.add('0_0_21_0_0',['文科','理科']);
dsy.add('0_0_21_1_0',['文科','理科']);
dsy.add('0_0_21_2_0',['文科','理科']);
dsy.add('0_0_22_0_0',['文科','理科']);
dsy.add('0_0_22_0_1',['综合']);
dsy.add('0_0_22_1_0',['文科','理科']);
dsy.add('0_0_22_2_0',['文科','理科']);
dsy.add('0_0_22_3_0',['文科','理科']);
dsy.add('0_0_23_0_0',['文科','理科']);
dsy.add('0_0_23_1_0',['文科','理科']);
dsy.add('0_0_23_2_0',['文科','理科']);
dsy.add('0_0_23_3_0',['文科','理科']);
dsy.add('0_0_24_0_0',['文科','理科']);
dsy.add('0_0_24_1_0',['文科','理科']);
dsy.add('0_0_24_2_0',['文科','理科']);
dsy.add('0_0_24_3_0',['文科','理科']);
dsy.add('0_0_25_0_0',['文科','理科']);
dsy.add('0_0_25_1_0',['文科','理科']);
dsy.add('0_0_25_2_0',['文科','理科']);
dsy.add('0_0_25_3_0',['文科','理科']);
dsy.add('0_0_26_0_0',['文科','理科']);
dsy.add('0_0_26_0_1',['理科']);
dsy.add('0_0_26_1_0',['文科','理科']);
dsy.add('0_0_26_2_0',['文科','理科']);
dsy.add('0_0_27_0_0',['文科','理科']);
dsy.add('0_0_27_1_0',['文科','理科']);
dsy.add('0_0_27_2_0',['文科','理科']);
dsy.add('0_0_27_3_0',['文科','理科']);
dsy.add('0_0_28_0_0',['文科','理科']);
dsy.add('0_0_28_1_0',['文科','理科']);
dsy.add('0_0_28_2_0',['文科','理科']);
dsy.add('0_0_28_3_0',['文科','理科']);
dsy.add('0_0_29_0_0',['文科','理科']);
dsy.add('0_0_29_1_0',['文科','理科']);
dsy.add('0_0_29_2_0',['文科','理科']);
dsy.add('0_0_29_3_0',['文科','理科']);
dsy.add('0_0_30_0_0',['文科','理科']);
dsy.add('0_0_30_1_0',['文科','理科']);
dsy.add('0_0_30_2_0',['文科','理科']);
dsy.add('0_0_30_3_0',['文科','理科']);
*/

/*
dsy.add('0_1_0_0_0',['文科','理科']);
dsy.add('0_1_0_0_1',['文科','理科']);
dsy.add('0_1_1_0_0',['文科','理科']);
dsy.add('0_1_1_0_1',['文科']);
dsy.add('0_1_2_0_0',['文科','理科']);
dsy.add('0_1_2_0_1',['综合']);
dsy.add('0_1_2_1_0',['文科','理科']);
dsy.add('0_1_2_2_0',['文科','理科']);
dsy.add('0_1_3_0_0',['文科','理科']);
dsy.add('0_1_3_1_0',['文科','理科']);
dsy.add('0_1_3_2_0',['文科','理科']);
dsy.add('0_1_4_0_0',['文科','理科','综合']);
dsy.add('0_1_4_0_1',['综合']);
dsy.add('0_1_4_1_0',['文科','理科']);
dsy.add('0_1_4_2_0',['文科','理科']);
dsy.add('0_1_4_3_0',['文科','理科']);
dsy.add('0_1_5_0_0',['文科','理科']);
dsy.add('0_1_5_0_1',['文科','理科']);
dsy.add('0_1_5_1_0',['文科','理科']);
dsy.add('0_1_5_2_0',['文科','理科']);
dsy.add('0_1_6_0_0',['文科','理科']);
dsy.add('0_1_6_0_1',['文科','理科']);
dsy.add('0_1_6_1_0',['文科','理科']);
dsy.add('0_1_6_2_0',['理科']);
dsy.add('0_1_6_3_0',['文科','理科']);
dsy.add('0_1_7_0_0',['文科','理科']);
dsy.add('0_1_7_0_1',['综合']);
dsy.add('0_1_7_1_0',['文科','理科']);
dsy.add('0_1_7_2_0',['文科','理科']);
dsy.add('0_1_7_3_0',['文科','理科']);
dsy.add('0_1_8_0_0',['综合']);
dsy.add('0_1_9_0_0',['文科','理科']);
dsy.add('0_1_9_0_1',['综合']);
dsy.add('0_1_10_0_0',['综合']);
dsy.add('0_1_10_1_0',['文科','理科','综合']);
dsy.add('0_1_11_0_0',['文科','理科']);
dsy.add('0_1_11_1_0',['文科','理科']);
dsy.add('0_1_11_2_0',['文科','理科']);
dsy.add('0_1_12_0_0',['文科','理科']);
dsy.add('0_1_12_1_0',['文科','理科']);
dsy.add('0_1_13_0_0',['文科','理科']);
dsy.add('0_1_13_1_0',['文科','理科']);
dsy.add('0_1_13_2_0',['文科','理科']);
dsy.add('0_1_14_0_0',['文科','理科']);
dsy.add('0_1_14_0_1',['文科','理科']);
dsy.add('0_1_14_1_0',['文科','理科']);
dsy.add('0_1_15_0_0',['文科','理科']);
dsy.add('0_1_15_0_1',['综合']);
dsy.add('0_1_15_1_0',['文科','理科']);
dsy.add('0_1_15_2_0',['文科','理科']);
dsy.add('0_1_16_0_0',['文科','理科']);
dsy.add('0_1_16_1_0',['文科','理科']);
dsy.add('0_1_16_2_0',['文科','理科']);
dsy.add('0_1_17_0_0',['文科','理科']);
dsy.add('0_1_17_0_1',['文科','理科']);
dsy.add('0_1_17_1_0',['文科','理科']);
dsy.add('0_1_17_2_0',['文科','理科']);
dsy.add('0_1_18_0_0',['文科','理科']);
dsy.add('0_1_18_0_1',['综合']);
dsy.add('0_1_18_1_0',['文科','理科']);
dsy.add('0_1_19_0_0',['文科','理科']);
dsy.add('0_1_19_1_0',['文科','理科']);
dsy.add('0_1_19_2_0',['文科','理科']);
dsy.add('0_1_19_3_0',['文科','理科']);
dsy.add('0_1_20_0_0',['文科','理科']);
dsy.add('0_1_20_0_1',['文科']);
dsy.add('0_1_20_1_0',['理科']);
dsy.add('0_1_20_2_0',['文科','理科']);
dsy.add('0_1_21_0_0',['文科','理科']);
dsy.add('0_1_21_1_0',['文科','理科']);
dsy.add('0_1_21_2_0',['文科','理科']);
dsy.add('0_1_22_0_0',['文科','理科','综合']);
dsy.add('0_1_22_0_1',['综合']);
dsy.add('0_1_22_1_0',['文科','理科']);
dsy.add('0_1_22_2_0',['文科','理科']);
dsy.add('0_1_22_3_0',['文科','理科']);
dsy.add('0_1_23_0_0',['文科','理科']);
dsy.add('0_1_23_1_0',['文科','理科']);
dsy.add('0_1_23_2_0',['文科','理科']);
dsy.add('0_1_23_3_0',['文科','理科']);
dsy.add('0_1_24_0_0',['文科','理科']);
dsy.add('0_1_24_1_0',['文科','理科']);
dsy.add('0_1_24_2_0',['文科','理科']);
dsy.add('0_1_24_3_0',['文科','理科']);
dsy.add('0_1_25_0_0',['文科','理科']);
dsy.add('0_1_25_1_0',['文科','理科']);
dsy.add('0_1_25_2_0',['文科','理科']);
dsy.add('0_1_25_3_0',['文科','理科']);
dsy.add('0_1_26_0_0',['文科','理科']);
dsy.add('0_1_26_1_0',['文科','理科']);
dsy.add('0_1_26_2_0',['文科','理科']);
dsy.add('0_1_27_0_0',['文科','理科']);
dsy.add('0_1_27_1_0',['文科','理科']);
dsy.add('0_1_27_2_0',['文科','理科']);
dsy.add('0_1_27_3_0',['文科','理科']);
dsy.add('0_1_28_0_0',['文科','理科']);
dsy.add('0_1_28_1_0',['文科','理科']);
dsy.add('0_1_28_2_0',['文科','理科']);
dsy.add('0_1_28_3_0',['文科','理科']);
dsy.add('0_1_29_0_0',['文科','理科']);
dsy.add('0_1_29_1_0',['文科','理科']);
dsy.add('0_1_29_2_0',['文科','理科']);
dsy.add('0_1_29_3_0',['文科','理科']);
dsy.add('0_1_30_0_0',['文科','理科']);
dsy.add('0_1_30_1_0',['文科','理科']);
dsy.add('0_1_30_2_0',['文科','理科']);
dsy.add('0_1_30_3_0',['文科','理科']);
dsy.add('0_1_30_4_0',['文科','理科']);



dsy.add('0_2_0_0_0',['文科','理科']);
dsy.add('0_2_0_0_1',['文科']);
dsy.add('0_2_1_0_0',['文科','理科']);
dsy.add('0_2_1_0_1',['理科']);
dsy.add('0_2_2_0_0',['文科','理科']);
dsy.add('0_2_2_0_1',['综合']);
dsy.add('0_2_2_1_0',['文科','理科']);
dsy.add('0_2_2_2_0',['文科','理科']);
dsy.add('0_2_3_0_0',['文科','理科']);
dsy.add('0_2_3_1_0',['文科','理科']);
dsy.add('0_2_3_2_0',['文科','理科']);
dsy.add('0_2_4_0_0',['文科','理科','综合']);
dsy.add('0_2_4_0_1',['综合']);
dsy.add('0_2_4_1_0',['文科','理科']);
dsy.add('0_2_4_2_0',['文科','理科']);
dsy.add('0_2_4_3_0',['文科','理科']);
dsy.add('0_2_5_0_0',['文科','理科']);
dsy.add('0_2_5_0_1',['文科','理科']);
dsy.add('0_2_5_1_0',['文科','理科']);
dsy.add('0_2_5_2_0',['文科','理科']);
dsy.add('0_2_6_0_0',['文科','理科']);
dsy.add('0_2_6_0_1',['文科','理科']);
dsy.add('0_2_6_1_0',['文科','理科']);
dsy.add('0_2_6_2_0',['理科']);
dsy.add('0_2_6_3_0',['文科','理科']);
dsy.add('0_2_7_0_0',['文科','理科']);
dsy.add('0_2_7_0_1',['综合']);
dsy.add('0_2_7_1_0',['文科','理科']);
dsy.add('0_2_7_2_0',['文科','理科']);
dsy.add('0_2_7_3_0',['文科','理科']);
dsy.add('0_2_8_0_0',['综合']);
dsy.add('0_2_9_0_0',['文科','理科']);
dsy.add('0_2_9_0_1',['综合']);
dsy.add('0_2_10_0_0',['综合']);
dsy.add('0_2_10_1_0',['文科','理科','综合']);
dsy.add('0_2_11_0_0',['文科','理科']);
dsy.add('0_2_11_1_0',['文科','理科']);
dsy.add('0_2_11_2_0',['文科','理科']);
dsy.add('0_2_12_0_0',['文科','理科']);
dsy.add('0_2_12_1_0',['文科','理科']);
dsy.add('0_2_13_0_0',['文科','理科']);
dsy.add('0_2_13_1_0',['文科','理科']);
dsy.add('0_2_13_2_0',['文科','理科']);
dsy.add('0_2_14_0_0',['文科','理科']);
dsy.add('0_2_14_0_1',['文科','理科']);
dsy.add('0_2_14_1_0',['文科','理科']);
dsy.add('0_2_15_0_0',['文科','理科']);
dsy.add('0_2_15_0_1',['综合']);
dsy.add('0_2_15_1_0',['文科','理科']);
dsy.add('0_2_15_2_0',['文科','理科']);
dsy.add('0_2_16_0_0',['文科','理科']);
dsy.add('0_2_16_0_1',['综合']);
dsy.add('0_2_16_1_0',['文科','理科']);
dsy.add('0_2_16_2_0',['文科','理科']);
dsy.add('0_2_17_0_0',['文科','理科']);
dsy.add('0_2_17_0_1',['文科']);
dsy.add('0_2_17_1_0',['文科','理科']);
dsy.add('0_2_17_2_0',['文科','理科']);
dsy.add('0_2_18_0_0',['文科','理科']);
dsy.add('0_2_18_0_1',['综合']);
dsy.add('0_2_18_1_0',['文科','理科']);
dsy.add('0_2_19_0_0',['文科','理科']);
dsy.add('0_2_19_1_0',['文科','理科']);
dsy.add('0_2_19_2_0',['文科','理科']);
dsy.add('0_2_19_3_0',['文科','理科']);
dsy.add('0_2_20_0_0',['文科','理科']);
dsy.add('0_2_20_0_1',['文科']);
dsy.add('0_2_20_1_0',['理科']);
dsy.add('0_2_20_2_0',['文科','理科']);
dsy.add('0_2_21_0_0',['文科','理科']);
dsy.add('0_2_21_1_0',['文科','理科']);
dsy.add('0_2_21_2_0',['文科','理科']);
dsy.add('0_2_22_0_0',['文科','理科','综合']);
dsy.add('0_2_22_0_1',['综合']);
dsy.add('0_2_22_1_0',['文科','理科']);
dsy.add('0_2_22_2_0',['文科','理科']);
dsy.add('0_2_22_3_0',['文科','理科']);
dsy.add('0_2_23_0_0',['文科','理科']);
dsy.add('0_2_23_1_0',['文科','理科']);
dsy.add('0_2_23_2_0',['文科','理科']);
dsy.add('0_2_23_3_0',['文科','理科']);
dsy.add('0_2_24_0_0',['文科','理科']);
dsy.add('0_2_24_1_0',['文科','理科']);
dsy.add('0_2_24_2_0',['文科','理科']);
dsy.add('0_2_24_3_0',['文科','理科']);
dsy.add('0_2_25_0_0',['文科','理科']);
dsy.add('0_2_25_1_0',['文科','理科']);
dsy.add('0_2_25_2_0',['文科','理科']);
dsy.add('0_2_25_3_0',['文科','理科']);
dsy.add('0_2_26_0_0',['文科','理科']);
dsy.add('0_2_26_1_0',['文科','理科']);
dsy.add('0_2_26_2_0',['文科','理科']);
dsy.add('0_2_27_0_0',['文科','理科']);
dsy.add('0_2_27_1_0',['文科','理科']);
dsy.add('0_2_27_2_0',['文科','理科']);
dsy.add('0_2_27_3_0',['文科','理科']);
dsy.add('0_2_28_0_0',['文科','理科']);
dsy.add('0_2_28_1_0',['文科','理科']);
dsy.add('0_2_28_2_0',['文科','理科']);
dsy.add('0_2_28_3_0',['文科','理科']);
dsy.add('0_2_29_0_0',['文科','理科']);
dsy.add('0_2_29_1_0',['文科','理科']);
dsy.add('0_2_29_2_0',['文科','理科']);
dsy.add('0_2_29_3_0',['文科','理科']);
dsy.add('0_2_30_0_0',['文科','理科']);
dsy.add('0_2_30_1_0',['文科','理科']);
dsy.add('0_2_30_2_0',['文科','理科']);
dsy.add('0_2_30_3_0',['文科','理科']);
dsy.add('0_2_30_4_0',['文科','理科']);

dsy.add('0_3_0_0_0',['文科','理科']);
dsy.add('0_3_1_0_0',['文科','理科']);
dsy.add('0_3_1_0_1',['文科']);
dsy.add('0_3_2_0_0',['文科','理科']);
dsy.add('0_3_2_0_1',['文科']);
dsy.add('0_3_2_1_0',['文科','理科']);
dsy.add('0_3_3_0_0',['文科','理科']);
dsy.add('0_3_3_1_0',['文科','理科']);
dsy.add('0_3_4_0_0',['文科','理科']);
dsy.add('0_3_4_0_1',['文科','理科']);
dsy.add('0_3_4_0_2',['文科','理科']);
dsy.add('0_3_4_1_0',['文科','理科']);
dsy.add('0_3_4_2_0',['文科','理科']);
dsy.add('0_3_5_0_0',['文科','理科']);
dsy.add('0_3_5_0_1',['文科','理科']);
dsy.add('0_3_5_0_2',['文科','理科']);
dsy.add('0_3_5_1_0',['理科']);
dsy.add('0_3_6_0_0',['文科','理科']);
dsy.add('0_3_6_0_1',['文科','理科']);
dsy.add('0_3_6_0_2',['文科','理科']);
dsy.add('0_3_6_1_0',['文科','理科']);
dsy.add('0_3_6_2_0',['理科']);
dsy.add('0_3_7_0_0',['文科','理科']);
dsy.add('0_3_7_0_1',['文科','理科']);
dsy.add('0_3_7_0_2',['文科','理科']);
dsy.add('0_3_7_1_0',['文科']);
dsy.add('0_3_7_2_0',['文科','理科']);
dsy.add('0_3_8_0_0',['文科','理科']);
dsy.add('0_3_9_0_0',['文科','理科']);
dsy.add('0_3_9_0_1',['文科']);
dsy.add('0_3_10_0_0',['文科','理科']);
dsy.add('0_3_11_0_0',['文科','理科']);
dsy.add('0_3_11_1_0',['文科','理科']);
dsy.add('0_3_12_0_0',['文科','理科']);
dsy.add('0_3_13_0_0',['文科','理科']);
dsy.add('0_3_13_1_0',['文科','理科']);
dsy.add('0_3_14_0_0',['文科','理科']);
dsy.add('0_3_14_0_1',['文科','理科']);
dsy.add('0_3_14_0_2',['文科','理科']);
dsy.add('0_3_15_0_0',['文科','理科']);
dsy.add('0_3_15_0_1',['文科','理科']);
dsy.add('0_3_15_1_0',['文科','理科']);
dsy.add('0_3_16_0_0',['文科','理科']);
dsy.add('0_3_16_0_1',['文科']);
dsy.add('0_3_16_1_0',['文科','理科']);
dsy.add('0_3_17_0_0',['文科','理科']);
dsy.add('0_3_17_1_0',['文科','理科']);
dsy.add('0_3_18_0_0',['文科','理科']);
dsy.add('0_3_19_0_0',['文科','理科']);
dsy.add('0_3_19_1_0',['文科','理科']);
dsy.add('0_3_19_2_0',['文科','理科']);
dsy.add('0_3_20_0_0',['文科','理科']);
dsy.add('0_3_20_0_1',['文科']);
dsy.add('0_3_20_1_0',['文科']);
dsy.add('0_3_21_0_0',['文科','理科']);
dsy.add('0_3_21_1_0',['文科','理科']);
dsy.add('0_3_22_0_0',['文科','理科']);
dsy.add('0_3_22_0_1',['文科','理科']);
dsy.add('0_3_22_1_0',['文科','理科']);
dsy.add('0_3_23_0_0',['文科','理科']);
dsy.add('0_3_23_1_0',['文科','理科']);
dsy.add('0_3_24_0_0',['文科','理科']);
dsy.add('0_3_24_1_0',['文科','理科']);
dsy.add('0_3_25_0_0',['文科','理科']);
dsy.add('0_3_25_1_0',['文科','理科']);
dsy.add('0_3_25_2_0',['文科','理科']);
dsy.add('0_3_26_0_0',['文科','理科']);
dsy.add('0_3_26_1_0',['文科','理科']);
dsy.add('0_3_27_0_0',['文科','理科']);
dsy.add('0_3_27_1_0',['文科','理科']);
dsy.add('0_3_27_2_0',['文科','理科']);
dsy.add('0_3_28_0_0',['文科','理科']);
dsy.add('0_3_28_1_0',['文科','理科']);
dsy.add('0_3_28_2_0',['文科','理科']);
dsy.add('0_3_29_0_0',['文科','理科']);
dsy.add('0_3_29_1_0',['文科','理科']);
dsy.add('0_3_29_2_0',['文科','理科']);
dsy.add('0_3_30_0_0',['文科','理科']);
dsy.add('0_3_30_1_0',['文科','理科']);
dsy.add('0_3_30_2_0',['文科','理科']);
dsy.add('0_3_30_3_0',['文科']);
*/

export const genEnrollPlan = (): void => {
  if (!existsSync("./r/function/enroll/"))
    mkdirSync("./r/function/enroll/", { recursive: true });
  writeFileSync("./r/function/enroll/plan.json", dsy.exportJSON());
};
